# FilterStringGreaterOrEqual Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterStringGreaterOrEqual Constructor
FilterStringGreaterOrEqual Class See Also
---
Constructs an instance of FilterStringGreaterOrEqual.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FilterStringGreaterOrEqual()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
FilterStringGreaterOrEqual()
```

# See Also
FilterStringGreaterOrEqual Class
Autodesk.Revit.DB Namespace